parallel/InterFoam/Junction/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    inlet1
    {
        type            patch;
        nFaces          194;
        startFace       1153640;
    }
    inlet2
    {
        type            patch;
        nFaces          154;
        startFace       1153834;
    }
    outlet
    {
        type            patch;
        nFaces          154;
        startFace       1153988;
    }
    atmosphere
    {
        type            patch;
        nFaces          258;
        startFace       1154142;
    }
    pipewall
    {
        type            patch;
        nFaces          163940;
        startFace       1154400;
    }
)

// ************************************************************************* //
